In [2]:
import pandas as pd
import numpy as np

# merge()

## 단일 key를 사용하는 경우

In [4]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                      'A': ['A0', 'A1', 'A2', 'A3'],
                      'B': ['B0', 'B1', 'B2', 'B3']})
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [5]:
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                       'C': ['C0', 'C1', 'C2', 'C3'],
                       'D': ['D0', 'D1', 'D2', 'D3']})
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [6]:
result = pd.merge(left, right, on='key')
result

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

## 다중 key를 사용하는 경우

In [7]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                      'A': ['A0', 'A1', 'A2', 'A3'],
                      'B': ['B0', 'B1', 'B2', 'B3']})
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [8]:
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                       'C': ['C0', 'C1', 'C2', 'C3'],
                       'D': ['D0', 'D1', 'D2', 'D3']})
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [9]:
result = pd.merge(left, right, on=["key1", 'key2'])
result

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

## parameter: how
    - how: {'left', 'right', 'outer', 'inner'}, default 'inner' Type of merge to be preformed
        * left: 왼쪽 프레임의 키만 사용, SQL left outer join과 유사
        * right: 오른쪽 프레임의 키만 사용, SQL right outer join과 유사
        * outer: 두 프레임의 키 통합 사용, SQL full outer join과 유사
        * inner: 두 프레임의 키 교차 사용, SQL inner join과 유사

In [11]:
result = pd.merge(left, right, how="left", on=['key1', 'key2'])
result

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [13]:
result = pd.merge(left, right, how='right', on=['key1', 'key2'])
result

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [14]:
result = pd.merge(left, right, how='outer', on=['key1', 'key2'])
result

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [15]:
result = pd.merge(left, right, on=['key1', 'key2'])
result

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [17]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [19]:
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                       'A': ['C0', 'C1', 'C2', 'C3'],
                       'D': ['D0', 'D1', 'D2', 'D3']})
right

  key1 key2   A   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [20]:
result = pd.merge(left, right, how='outer', on=['key1', 'key2'])
result

  key1 key2  A_x    B  A_y    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [21]:
result = pd.merge(left, right, how='outer', on=['key1', 'key2'], suffixes=('_1', '_2'))
result

  key1 key2  A_1    B  A_2    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

# join()

In [22]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                    index=['K0', 'K1', 'K2'])
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [23]:
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                     index=['K0', 'K2', 'K3'])
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [24]:
result = left.join(right)
result

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [25]:
result = left.join(right, how='outer')
result

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [26]:
result = left.join(right, how='inner')
result

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

# groupby()

In [27]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                         'foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three',
                         'two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.367198 -0.572153
1  bar    one -0.325688 -0.211189
2  foo    two -0.156199 -0.096257
3  bar  three  1.169704 -1.093317
4  foo    two -0.624702  0.857650
5  bar    two -0.658131  0.985262
6  foo    one -0.705670 -1.331373
7  foo  three -0.748924 -0.315914

In [28]:
result = df.groupby('A').std()
result

            C         D
A
bar  0.973627  1.043243
foo  0.477031  0.793625

In [29]:
result = df.groupby('B').sum()
result

              C         D
B
one   -0.664160 -2.114714
three  0.420780 -1.409230
two   -1.439032  1.746655

In [30]:
result = df.groupby(['A', 'B']).sum()
result

                  C         D
A   B
bar one   -0.325688 -0.211189
    three  1.169704 -1.093317
    two   -0.658131  0.985262
foo one   -0.338472 -1.903526
    three -0.748924 -0.315914
    two   -0.780901  0.761393

In [31]:
arrays = [['Falcon', 'Falcon', 'Parrot', 'Parrot'],
          ['Captive', 'Wild', 'Captive', 'Wild']]
index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))
df = pd.DataFrame({'Max Speed': [390., 350., 30., 20.]},
                  index=index)
df

                Max Speed
Animal Type
Falcon Captive      390.0
       Wild         350.0
Parrot Captive       30.0
       Wild          20.0

In [32]:
result = df.groupby(level=0).mean()
result

        Max Speed
Animal
Falcon      370.0
Parrot       25.0

In [33]:
result = df.groupby(level=1).mean()
result

         Max Speed
Type
Captive      210.0
Wild         185.0

# pivot_table()
    - Create a spreadsheet-style pivot table as a DataFrame.
        * aggfunc: default numpy.mean: 데이터 집계시 사용할 함수
        * margins: default False: 행/열 별 총합
        * margins_name: default 'All': 총합 행/열의 이름

In [34]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                         "bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two",
                         "one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small",
                         "small", "large", "small", "small",
                         "large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                   "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [36]:
table = pd.pivot_table(df, index="A", columns=['B', 'C'], values="D")
table

B     one         two
C   large small large small
A
bar   4.0   5.0   7.0   6.0
foo   2.0   1.0   NaN   3.0

In [37]:
table = pd.pivot_table(df, index=['A', 'B'], columns='C', values='D') 
table

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    2.0    1.0
    two    NaN    3.0

In [38]:
table = pd.pivot_table(df, index=['A', 'B'], columns='C', values='D', aggfunc=np.sum) 
table

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

In [39]:
table = pd.pivot_table(df, index=['A', 'B'], columns='C', values='D', aggfunc=np.sum, fill_value=0) 
table

C        large  small
A   B
bar one      4      5
    two      7      6
foo one      4      1
    two      0      6

In [40]:
table = pd.pivot_table(df, index=['A', 'B'], columns='C', values='D', aggfunc=np.sum, fill_value=0, margins=True) 
table

C        large  small  All
A   B
bar one      4      5    9
    two      7      6   13
foo one      4      1    5
    two      0      6    6
All         15     18   33

In [41]:
table = pd.pivot_table(df, index=['A', 'B'], columns='C', values='D', aggfunc=np.sum, fill_value=0, margins=True, margins_name='Total') 
table

C          large  small  Total
A     B
bar   one      4      5      9
      two      7      6     13
foo   one      4      1      5
      two      0      6      6
Total         15     18     33

# melt()
    - id_vars: optional: 기준열 지정
    - value_vars: optional: 행으로 들어갈 열을 지정. 지정하지 않으면 'id_vars'에 지정되지 않은 모든 열이 지정
    - var_name: 'variable'열의 이름 지정
    - value_name: 'value'열의 이름 지정

In [42]:
person = pd.DataFrame({'first': ['John', 'Mary'],
                       'last': ['Doe', 'Bo'],
                       'height': [5.5, 6.0],
                       'weight': [130, 150]})
person

  first last  height  weight
0  John  Doe     5.5     130
1  Mary   Bo     6.0     150

In [43]:
melt_data = person.melt(id_vars=['first', 'last'])
melt_data

  first last variable  value
0  John  Doe   height    5.5
1  Mary   Bo   height    6.0
2  John  Doe   weight  130.0
3  Mary   Bo   weight  150.0

In [44]:
melt_data = person.melt(id_vars=['first', 'last'], var_name='body', value_name='size')
melt_data

  first last    body   size
0  John  Doe  height    5.5
1  Mary   Bo  height    6.0
2  John  Doe  weight  130.0
3  Mary   Bo  weight  150.0

In [45]:
melt_data = person.melt(id_vars=['first', 'last'], var_name='body', value_name='size', value_vars='height')
melt_data

  first last    body  size
0  John  Doe  height   5.5
1  Mary   Bo  height   6.0

# stack()

In [46]:
stack_data = table.stack()
stack_data

A      B    C
bar    one  large     4
            small     5
            Total     9
       two  large     7
            small     6
            Total    13
foo    one  large     4
            small     1
            Total     5
       two  large     0
            small     6
            Total     6
Total       large    15
            small    18
            Total    33
dtype: int64

In [48]:
table = stack_data.unstack()
table

C          large  small  Total
A     B
Total         15     18     33
bar   one      4      5      9
      two      7      6     13
foo   one      4      1      5
      two      0      6      6

In [49]:
table = stack_data.unstack(0)
table

A          Total   bar  foo
B   C
    large   15.0   NaN  NaN
    small   18.0   NaN  NaN
    Total   33.0   NaN  NaN
one large    NaN   4.0  4.0
    small    NaN   5.0  1.0
    Total    NaN   9.0  5.0
two large    NaN   7.0  0.0
    small    NaN   6.0  6.0
    Total    NaN  13.0  6.0

In [50]:
table = stack_data.unstack(1)
table

B                  one   two
A     C
Total large  15.0  NaN   NaN
      small  18.0  NaN   NaN
      Total  33.0  NaN   NaN
bar   large   NaN  4.0   7.0
      small   NaN  5.0   6.0
      Total   NaN  9.0  13.0
foo   large   NaN  4.0   0.0
      small   NaN  1.0   6.0
      Total   NaN  5.0   6.0

In [51]:
stack_data.unstack(2)

C          large  small  Total
A     B
Total         15     18     33
bar   one      4      5      9
      two      7      6     13
foo   one      4      1      5
      two      0      6      6

In [52]:
stack_data.unstack('C')

C          large  small  Total
A     B
Total         15     18     33
bar   one      4      5      9
      two      7      6     13
foo   one      4      1      5
      two      0      6      6